MedicNITE_p1/app/controllers/pacientes_controller.rb

SELECT `pacientes`.* FROM `pacientes`
SELECT `personas`.* FROM `personas`
---
  def index
    @paciente = Paciente.new
    @pacientes = Paciente.all

    @personas = Persona.search(params[:searchpaciente]).paginate(:page => params[:page], :per_page => 5)

SELECT COUNT(*) FROM `personas` WHERE (nombresPersona LIKE '%%')
SELECT `personas`.* FROM `personas` WHERE (nombresPersona LIKE '%asd%') LIMIT 5 OFFSET 0
SELECT `paciente_estados`.* FROM `paciente_estados`
SELECT `paciente_tipos`.* FROM `paciente_tipos`
---
  def new
    @paciente = Paciente.new

    @paciente_estado = PacienteEstado.new
    @paciente_tipo = PacienteTipo.new

    # Personas + búsqueda + paginación
    @paciente_personas = Persona.search(params[:searchpersona]).paginate(:page => params[:page], :per_page => 5)

    @paciente_estados = PacienteEstado.all
    @paciente_tipos = PacienteTipo.all

INSERT INTO `pacientes` (`idEstadoPaciente`, `idPersona`, `idTipoPaciente`) VALUES (NULL, NULL, NULL)
---
  def create
    @paciente = Paciente.new(paciente_params)

    respond_to do |format|
      if @paciente.save