MedicNITE_p1/app/controllers/paciente_estados_controller.rb

SELECT `paciente_estados`.* FROM `paciente_estados`
---
  def index
    @paciente_estados = PacienteEstado.all

INSERT INTO `paciente_estados` (`estadoPaciente`) VALUES ('Ambulatorio')
---
  def create
    @paciente_estado = PacienteEstado.new(paciente_estado_params)

    respond_to do |format|
      if @paciente_estado.save