MedicNITE_p1/app/controllers/paciente_tipos_controller.rb

SELECT `paciente_tipos`.* FROM `paciente_tipos`
---
  def index
    @paciente_tipos = PacienteTipo.all

INSERT INTO `paciente_tipos` (`tipoPaciente`) VALUES ('Ingresado')
---
  def create
    @paciente_tipo = PacienteTipo.new(paciente_tipo_params)

    respond_to do |format|
      if @paciente_tipo.save

UPDATE `paciente_tipos` SET `tipoPaciente` = 'Ambulatorio' WHERE `paciente_tipos`.`idTipoPaciente` = 1
---
  def update
    respond_to do |format|
      if @paciente_tipo.update(paciente_tipo_params)