MedicNITE_p1/app/controllers/personas_controller.rb

  def index
    @personas = Persona.all
---
SELECT `personas`.* FROM `personas`

  def create
    @persona = Persona.new(persona_params)

    respond_to do |format|
      if @persona.save
---
INSERT INTO `personas` (`apellidosPersona`, `created_at`, `domicilioPersona`, `fechaNacimientoPersona`, `idPersona`, `nombresPersona`, `rutPersona`, `updated_at`) VALUES ('Landaeta Sanchez', '2013-12-29 01:58:21', 'Embajador Quintana #4368', '2008-08-29', 1, 'Mosheh-efra Osvaldo', '111-1', '2013-12-29 01:58:21')

  def update
    respond_to do |format|
      if @persona.update(persona_params)
---
UPDATE `personas` SET `nombresPersona` = 'esteban asd', `apellidopaternoPersona` = 'gaete', `apellidomaternoPersona` = 'flores', `updated_at` = '2013-12-16 23:17:04' WHERE `personas`.`id` = 2

  def destroy
    @persona.destroy
---
DELETE FROM `personas` WHERE `personas`.`id` = 2

    def set_persona
      @persona = Persona.find(params[:id])
---
SELECT `personas`.* FROM `personas` WHERE `personas`.`id` = 2 LIMIT 1