MedicNITE_p1/app/controllers/tipo_personas_controller.rb

SELECT `tipo_personas`.* FROM `tipo_personas`
---
  def index
    @tipo_personas = TipoPersona.all

INSERT INTO `tipo_personas` (`created_at`, `nombreTipoPersona`, `updated_at`) VALUES ('2013-12-17 19:37:01', 'Médico', '2013-12-17 19:37:01')
---
  def create
    @tipo_persona = TipoPersona.new(tipo_persona_params)

    respond_to do |format|
      if @tipo_persona.save

UPDATE `tipo_personas` SET `nombreTipoPersona` = 'Médico', `updated_at` = '2013-12-17 19:37:57' WHERE `tipo_personas`.`id` = 3
---
  def update
    respond_to do |format|
      if @tipo_persona.update(tipo_persona_params)

SELECT `tipo_personas`.* FROM `tipo_personas` WHERE `tipo_personas`.`id` = 3 LIMIT 1
---
    def set_tipo_persona
      @tipo_persona = TipoPersona.find(params[:id])